DataProcessors/ЗагрузкаОбращениеВГАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаОбращениеВГАС</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ОбращенияВГАС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ОбращенияВГАС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатусОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КредитныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКомментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузкаОбращениеВГАС/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
		    ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
 	

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗагрузитьНаСервере(ДвоичныеДанные, Расширение)

	    ФайлEXCELНаСервере = ПолучитьИмяВременногоФайла(Расширение);
	   ДвоичныеДанные.Записать(ФайлEXCELНаСервере);
	 	    
	   ФайлЕксел.Прочитать(ФайлEXCELНаСервере,СпособЧтенияЗначенийТабличногоДокумента.Текст);
	   УдалитьФайлы(ФайлEXCELНаСервере);
		
       ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();

	   Для каждого стр Из ТаблицаЗначений Цикл
				  
		   
		   Если стр.НомерОбращения<>""  Тогда
					  
			   ссылкаДоговор=НайтиСсылкаДоговор(стр.НомерДоговора,стр.ФИО);
			   
			   ссылкаДок= ПолучитьСсылкуПоGUID(стр.GUID);
			   
			   
			   
			   ЗаписатьОбращенияВГАС(ссылкаДоговор,ссылкаДок,стр.НомерОбращения);
			   
			 				  	
				  
			КонецЕсли;
				  
			
		   
	   КонецЦикла;		   
	   
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьОбращенияВГАС(КрДог,ссылкаДок,номерОбращения)

	
	          
	         ссылкаСправочник=Неопределено;
			 
			 
	  
	    	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ОбращенияВГАС.Ссылка КАК Ссылка,
					|	ОбращенияВГАС.Наименование КАК Наименование
					|ИЗ
					|	Справочник.ОбращенияВГАС КАК ОбращенияВГАС
					|ГДЕ
					|	ОбращенияВГАС.КредитныйДоговор = &КредитныйДоговор
					|	И ОбращенияВГАС.СсылкаДокумент = &СсылкаДокумент";
				
				Запрос.УстановитьПараметр("КредитныйДоговор", КрДог);
				Запрос.УстановитьПараметр("СсылкаДокумент",ссылкаДок );
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					// Вставить обработку выборки ВыборкаДетальныеЗаписи
					ссылкаСправочник=ВыборкаДетальныеЗаписи.Ссылка;
				КонецЦикла;
				
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

				
				Если ссылкаСправочник<>Неопределено Тогда
				
					 об=ссылкаСправочник.ПолучитьОбъект();
					 
					 об.Наименование=номерОбращения;
					 
					 об.Записать();
				
				Иначе
					
					
					новаяЗапись=Справочники.ОбращенияВГАС.СоздатьЭлемент();
					новаяЗапись.КредитныйДоговор=КрДог;
					новаяЗапись.СсылкаДокумент=ссылкаДок;
					
					новаяЗапись.Наименование=номерОбращения;
					
					новаяЗапись.Записать();
					
					
				
				КонецЕсли;

	
	
	
	
	
	
	
	
	
					//новаяЗапись.КредитныйДоговор=КредитныйДоговор;
					//новаяЗапись.СсылкаДокумент=СсылкаДокумент;
					//
					//новаяЗапись.Наименование=НомерОбращения;

	   
	
	
	

КонецПроцедуры

&НаСервере
Функция НайтиСсылкаДоговор(номерДоговора,фиодолж)

	        ссылкаДоговор=Неопределено;
	       	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.НомерДоговора = &НомерДоговора
				|	И Договоры.Владелец.Наименование = &Наименование";
			
			Запрос.УстановитьПараметр("Наименование", фиодолж);
			Запрос.УстановитьПараметр("НомерДоговора", номерДоговора);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				ссылкаДоговор=ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

			
	
	    Возврат ссылкаДоговор;

КонецФункции // ()





&НаСервере
Функция ПолучитьСсылкуПоGUID(стрguid)
	
	  ссылкаДокумент=Неопределено;
	
	    Для Каждого Менеджер Из Справочники Цикл

			     Попытка
				 
					 НовыйGUID = Новый УникальныйИдентификатор(стрguid);

					 ссылкаД = Менеджер.ПолучитьСсылку(НовыйGUID);

					 
					 Если ссылкаД.ПолучитьОбъект() <> Неопределено Тогда
						 
						 ссылкаДокумент=ссылкаД; 
						 
						 
					 КонецЕсли;

					 
					 
				 
				 Исключение
					 
					   ТекстОшибки = ОписаниеОшибки();
					  Сообщить(ТекстОшибки);

					 
				 КонецПопытки;
			
		   
		   
		КонецЦикла;
	
	
	   Возврат ссылкаДокумент;
		
		

КонецФункции // ()





&НаКлиенте
Процедура Загрузить(Команда)
	
	 
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);

	ЗагрузитьНаСервере(ДвоичныеДанные,Файл.Расширение);
	Сообщить("Ок");

	
	
КонецПроцедуры
